#include <stdio.h>
#include <locale.h>

void name()
{
	puts("** ------------------------------------------------------------------------------------------ **");
	puts("**            Написание и компиляция консольного приложения в среде разработки MVS 2022       **");
	puts("** бист-223                                                                                   **");
	puts("** Смоленская Мария                                                                           **");
	puts("** ------------------------------------------------------------------------------------------ **");
}

void date()
{
	puts("  _  __      _     _      ");
	puts(" | |   |  | | |   | | | | ");
	puts(" | |  /   | | |   | |  -|    ");
	puts("  -   | . |  -  .  -    |  .  ");
}

void main()
{
	//1 задание
	puts("Hello, world!");

	setlocale(LC_ALL, "RUS");
	puts("Моя программа");

	//2 задание
	puts("\n 2 задание");
	puts("** ------------------------------------------------------------------------------------------ **");
	puts("**            Написание и компиляция консольного приложения в среде разработки MVS 2022       **");
	puts("** бист-223                                                                                   **");
	puts("** Смоленская Мария                                                                           **");
	puts("** ------------------------------------------------------------------------------------------ **");

	//3 задание
	puts("\n 3 задание");
	puts("  _  __      _     _      ");
	puts(" | |   |  | | |   | | | | ");
	puts(" | |  /   | | |   | |  -|    ");
	puts("  -   | . |  -  .  -    |  .  ");

	//4 задание
	puts("\n 4 задание");
	name();
	date();

	//5 задание
	puts("\n 5 задание");
	puts("             |\\            ");
	puts("             | \\       ");
	puts("             |  \\        ");
	puts("             |----            ");
	puts("             |           ");
	puts("             |             ");
	puts("   _______________________         ");
	puts("  \\                      /  ");
	puts("   \\                    /");
	puts("     -------------------        ");



}